const jokes = [
    "चेला – बाबा, दाहिने हाथ में खुजलाहट है। बाबा – वत्स, लक्ष्मी आने वाली हैं। चेला – दाएं पैर में भी खुजलाहट है। बाबा – यात्रा योग बन रहा चेला – पेट पर भी खुजलाहट है। बाबा – उत्तम भोजन की प्राप्ति होगी चेला – गर्दन पर भी खुजलाहट है। बाबा – दूर हट, तुझे खुजली की बीमारी है ",
    "मां अपने तोतले बेटे से बोली: बेटा आज हम जहां लड़की देखने जा रहे हैं, तुम वहां बोलना मत, वरना ये लोग भी मना कर देंगे। बेटाः थीत है। लड़की वालों के घर जब लड़की चाय लेकर आई तो लड़का चाय पीते ही बोला, “दलम है दलम है। लड़की तुरंत बोली, ओए फूत माल फूत माल! ",
    "बंता wife को English सिखा रहा था। दोपहर में Wife बोली, “Dinner लो जी”. बंता – जाहिल औरत ये Dinner नही Lunch है..” Wife – जाहिल तू, तेरा सारा ख़ानदान करमफूटे…ये रात का बचा हुआ खाना है… दिमाग मत दौड़ा, रोटी चरले। ",
    "शिष्य – गुरूजी, ऐसी पत्नी को क्या कहते हैं जो गोरी हो, लंबी हो, सुन्दर हो, होशियार हो, पति को समझती हो कभी झगड़ा नहीं करती हो ? गुरूजी – उसे मन का वहम कहते हैं बेटा.. मन का वहम !… ",
    "Latest Jokes in Hindi पत्नी पति से: अजी सुनते हो, पड़ोस की पिंकी को maths में 100 में से 99 marks मिलें हैं.. पति: अच्छा, तो 1 mark कहाँ गया? पत्नी: अपना बेटा ले के आया है ",
    "Sanskrit Teacher – What is the meaning of ‘तमसो मा ज्योर्तिगमय’ Student Said – “तू सो जा  माँ, मैं ज्योति  के घर जा रहा हुँ ।” ",
    "पत्नी:- आपको मेरी सुंदरता ज़्यादा अच्छी लगती है या मेरे संस्कार…? …. पति:- मुझे तो तेरी ये मज़ाक करने की आदत बहुत अच्छी लगती है। ",
    "पत्नी: उठो सुबह हो गई, पति: आंख नही खुल रही है, ऐसा कुछ बोलो कि नीद गायब हो जाए। . पत्नी: रात में जिस जानू से चैट कर रहे थे, वो मेरी दूसरी ID है। अब बेचारे पति को 3 दिन से नीद नही आ रही है।"
]
let hindi = document.getElementById('btn1')
console.log(jokes[3])
hindi.addEventListener('click', function() {

    const card = document.querySelector('.card');
    const randomNumber = Math.floor(Math.random() * 10 );
    card.classList.toggle('show-card');
    let p = document.getElementsByClassName('card-body')[0]
    p.innerHTML=jokes[randomNumber]

  });
